In [770]:
import os
import glob
import pandas as pd
import numpy as np
import random
os.chdir('/Users/rishi/Desktop/DAEN 690/indeed')

In [807]:
extension = 'csv'
csv_file = [i for i in glob.glob('*.{}'.format(extension))]

In [808]:
combined_csv = pd.concat([pd.read_csv(f) for f in csv_file ])
combined_csv.to_csv( "Job_posting_indeed.csv", index=False, encoding='utf-8-sig')

In [809]:
indeed=pd.read_csv('Job_posting_indeed.csv')

In [810]:
#delete the first column
del indeed['Unnamed: 0']

In [811]:
#method 1 for removinfg new from title
indeed['title'] = indeed['title'].str.lstrip('new')

In [812]:
#method 2 for removing new from title
#   indeed['newcol']=np.where(indeed['title'].str[:3]=='new', indeed['title'].str[3:], indeed['title'])

In [813]:
indeed.head()

,title,company,salary,summary,location
0,Software Developer (No Prior Experience Required),Revature,NaN,College degree (Associates or Bachelors).\nMus...,"Washington, DC"
1,SQL Application Developer,ServiceSource Inc.,NaN,Assist with the management and coordination be...,"Capitol Heights, MD"
2,GIS Developer,Leidos,NaN,Train other team members on GIS and other GIS ...,"Washington, DC 20090 (South West area)+1 location"
3,Jr Software Developer,KSquare Inc.,NaN,BS/ MS in IT or equivalent is required with st...,"Greenbelt, MD 20770"
4,HP059 Junior Software Developer,"ADNET Systems, Inc.",NaN,Experience with using a Git workflow for softw...,"Greenbelt, MD 20771"

In [814]:
indeed.isnull().sum()

title           0
company         0
salary      11121
summary         0
location        0
dtype: int64

In [815]:
indeed.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12889 entries, 0 to 12888
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   title     12889 non-null  object
 1   company   12889 non-null  object
 2   salary    1768 non-null   object
 3   summary   12889 non-null  object
 4   location  12889 non-null  object
dtypes: object(5)
memory usage: 503.6+ KB

In [816]:
#indeed['Experience'] = np.random.randint(1, 8, indeed.shape[0])

In [817]:
indeed['salary'] = indeed['salary'].str.rstrip('a year')
indeed['salary'] = indeed['salary'].str.rstrip('an hour')
indeed['salary'] = indeed['salary'].str.rstrip('a week')
indeed['salary'] = indeed['salary'].str.rstrip('a month')
indeed['salary'] = indeed['salary'].str.lstrip('Up to ')
indeed['salary'] = indeed['salary'].str.lstrip('From ')
indeed['salary'] = indeed['salary'].str.rstrip(' a d')

In [818]:
indeed[['salary1','salary2']] = indeed.salary.str.split("-",expand=True)
indeed['salary1'] = indeed['salary1'].str.lstrip('$')
indeed['salary2'] = indeed['salary2'].str.lstrip(' $')

In [819]:
#indeed['salary1'] = indeed['salary1'].fillna(0)
#indeed['salary2'] = indeed['salary2'].fillna(0)

In [820]:
indeed['salary1'] = indeed['salary1'].replace(',','', regex=True)
indeed['salary2'] = indeed['salary2'].replace(',','', regex=True)
#indeed['salary1'] = indeed['salary1'].replace('$','', regex=True)
#indeed['salary2'] = indeed['salary2'].replace('$','', regex=True)


#indeed['salary1'] = pd.to_numeric(indeed['salary1'])
#indeed['salary2'] = indeed['salary2'].astype(int)

In [821]:
indeed['salary1'] = pd.to_numeric(indeed['salary1'])
indeed['salary2'] = pd.to_numeric(indeed['salary2'])

In [822]:
#indeed['salary1'] = indeed['salary1'].astype(int)
#indeed['salary2'] = indeed['salary2'].astype(int)

In [823]:
for i in range(0,len(indeed)):    
    if indeed['salary1'][i] in range(0,200):
        indeed['salary1'][i] = (indeed['salary1'][i]) * 40 * 52
    elif (indeed['salary1'][i]) in range(201,4000):
        indeed['salary1'][i] = (indeed['salary1'][i]) * 52
    elif (indeed['salary1'][i]) in range(4001,30000):
        indeed['salary1'][i] = (indeed['salary1'][i]) *12

/Users/rishi/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until
/Users/rishi/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """
/Users/rishi/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  import sys

In [824]:
for i in range(0,len(indeed)):    
    if indeed['salary2'][i] in range(0,200):
        indeed['salary2'][i] = (indeed['salary2'][i]) * 40 * 52
    elif (indeed['salary2'][i]) in range(201,3000):
        indeed['salary2'][i] = (indeed['salary2'][i]) * 52
    elif (indeed['salary2'][i]) in range(3001,30000):
        indeed['salary2'][i] = (indeed['salary2'][i]) *12

/Users/rishi/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until
/Users/rishi/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  import sys

In [825]:
del indeed['salary']

In [826]:
indeed1 = indeed.copy()

In [827]:
indeed2 = indeed.copy()

In [828]:
del indeed1['salary2']

In [829]:
del indeed2['salary1']

In [830]:
indeed1['Experience'] = np.random.randint(1, 5, indeed.shape[0])

In [831]:
indeed2['Experience'] = np.random.randint(6, 11, indeed.shape[0])

In [832]:
#a = indeed2['salary2'].max()

In [833]:
#b = indeed2['salary2'].min()

In [834]:
#indeed1['salary1'] = indeed1['salary1'].replace([0],'')
#indeed2['salary2'] = indeed2['salary2'].replace([0],'')

In [835]:
indeed2['salary2'] = indeed2['salary2'].apply(lambda x: x if pd.notnull(x) else np.random.randint(indeed2['salary2'].min(), indeed2['salary2'].max()))

In [836]:
indeed2

,title,company,summary,location,salary2,Experience
0,Software Developer (No Prior Experience Required),Revature,College degree (Associates or Bachelors).\nMus...,"Washington, DC",181944.0,8
1,SQL Application Developer,ServiceSource Inc.,Assist with the management and coordination be...,"Capitol Heights, MD",201611.0,8
2,GIS Developer,Leidos,Train other team members on GIS and other GIS ...,"Washington, DC 20090 (South West area)+1 location",167646.0,6
3,Jr Software Developer,KSquare Inc.,BS/ MS in IT or equivalent is required with st...,"Greenbelt, MD 20770",99524.0,7
4,HP059 Junior Software Developer,"ADNET Systems, Inc.",Experience with using a Git workflow for softw...,"Greenbelt, MD 20771",113978.0,8
...,...,...,...,...,...,...
12884,VIRTUAL Senior Machine Learning/AI Developer,Deloitte,"Collaborate with data scientists, data enginee...","McLean, VA+1 location•Remote",200700.0,7
12885,"Artificial Intelligence Solutions Architect, S...",Booz Allen Hamilton,Set and execute an Artificial Intelligence (AI...,"Annapolis Junction, MD 20701",148224.0,10
12886,Senior Data Analyst,Confidential Priviately-Held Company,Data mapping (data definitions and business ru...,United States,175000.0,10
12887,Senior Data Scientist,IXIS Digital,"Expertise working with data in the wild, inclu...",United States•Remote,153256.0,8
12888,Deep Learning Analytics – Senior Advanced Data...,"General Dynamics Mission Systems, Inc",Direct and collaborate with a dispersed and di...,United States•Remote,209487.0,8

In [837]:
indeed1['salary1'] = indeed1['salary1'].apply(lambda x: x if pd.notnull(x) else np.random.randint(indeed1['salary1'].min(), indeed1['salary1'].max()))

In [838]:
#indeed2.isnull().sum()

title         0
company       0
summary       0
location      0
salary2       0
Experience    0
dtype: int64

In [839]:
#indeed1['salary1'] = indeed1['salary1'].map(
#    lambda x: np.random.choice([c, d]) if np.isnan(x) else x
#)

In [840]:
indeed1 = indeed1.rename(columns = {"salary1":"salary"})

In [1037]:
indeed2 = indeed2.rename(columns = {"salary2":"salary"})

In [1010]:
os.chdir('/Users/rishi/Desktop/DAEN 690/glassdoor')

In [1011]:
glassdoor=pd.read_csv('jobs.csv')

In [1012]:
del glassdoor['Rating']
del glassdoor['Headquarters']
del glassdoor['Size']
del glassdoor['Founded']
del glassdoor['Type of ownership']
del glassdoor['Industry']
del glassdoor['Sector']
del glassdoor['Revenue']
del glassdoor['Competitors']
del glassdoor['Easy Apply']

In [1013]:
#glassdoor['Experience'] = np.random.randint(1, 8, glassdoor.shape[0])

In [1014]:
glassdoor.rename(columns={'Job Title': 'title', 'Salary Estimate': 'salary','Job Description':'summary','Company Name':'company','Location':'location'}, inplace=True)

In [1015]:
glassdoor.head()

,title,salary,summary,company,location
0,Project Manager / Business Analyst,$77K-$151K (Glassdoor est.),Project Manager / Business Analyst\n\n\nIn the...,DNTG\n2.9,"Buena Park, CA"
1,Project Manager / Business Analyst,$41K-$81K (Glassdoor est.),This is a hybrid role of PM and BA with 3 to 5...,Diversant LLC\n3.8,"Houston, TX"
2,Project Manager/Business Consultant,$45K-$53K (Glassdoor est.),Project Manager/Business Consultant\n\nRespons...,TEC Group Inc,"Houston, TX"
3,Project Manager Business Analyst,$89K-$107K (Glassdoor est.),"Job Description\nAt E78, we assist our clients...",Trillium Solutions Group\n4.8,"Horsham, PA"
4,Project Manager Business Analyst,$36K-$73K (Glassdoor est.),Job Description\nCSS Tec is currently seeking ...,Contemporary Staffing Solutions\n4.4,"Jacksonville, FL"

In [1016]:
glassdoor['salary'] = glassdoor['salary'].str.rstrip(' (Glassdoor est.)')

In [1017]:
glassdoor['salary'] = glassdoor['salary'].str.rstrip('(Employ')

In [1018]:
glassdoor['salary']

0       $77K-$151K
1        $41K-$81K
2        $45K-$53K
3       $89K-$107K
4        $36K-$73K
           ...
2137     $43K-$72K
2138    $91K-$143K
2139    $48K-$107K
2140    $48K-$107K
2141    $48K-$107K
Name: salary, Length: 2142, dtype: object

In [1019]:
glassdoor['salary'] = glassdoor['salary'].str.rstrip('a year')
glassdoor['salary'] = glassdoor['salary'].str.rstrip('an hour')
glassdoor['salary'] = glassdoor['salary'].str.rstrip('a week')
glassdoor['salary'] = glassdoor['salary'].str.rstrip('a month')
#glassdoor['salary'] = glassdoor['salary'].str.lstrip('Up to ')
#glassdoor['salary'] = glassdoor['salary'].str.lstrip('From ')
glassdoor['salary'] = glassdoor['salary'].str.rstrip('Per Hou')

In [1020]:
glassdoor[['salary1','salary2']] = glassdoor.salary.str.split("-",expand=True)
glassdoor['salary1'] = glassdoor['salary1'].str.lstrip('$')
glassdoor['salary2'] = glassdoor['salary2'].str.lstrip(' $')
glassdoor['salary1'] = glassdoor['salary1'].str.lstrip('$')
glassdoor['salary2'] = glassdoor['salary2'].str.lstrip(' $')

In [1021]:
glassdoor['salary1'] = glassdoor['salary1'].str.rstrip('K')
glassdoor['salary2'] = glassdoor['salary2'].str.rstrip('K')

In [1022]:
glassdoor['salary1'] = pd.to_numeric(glassdoor['salary1'])
glassdoor["salary1"] = 1000 * glassdoor["salary1"]
glassdoor['salary2'] = pd.to_numeric(glassdoor['salary2'])
glassdoor["salary2"] = 1000 * glassdoor["salary2"]

In [1028]:
del glassdoor['salary']

In [1029]:
glassdoor1 = glassdoor.copy()

In [1030]:
glassdoor2 = glassdoor.copy()

In [1031]:
del glassdoor1['salary2']

In [1032]:
del glassdoor2['salary1']

In [1033]:
glassdoor1

,title,summary,company,location,salary1
0,Project Manager / Business Analyst,Project Manager / Business Analyst\n\n\nIn the...,DNTG\n2.9,"Buena Park, CA",77000
1,Project Manager / Business Analyst,This is a hybrid role of PM and BA with 3 to 5...,Diversant LLC\n3.8,"Houston, TX",41000
2,Project Manager/Business Consultant,Project Manager/Business Consultant\n\nRespons...,TEC Group Inc,"Houston, TX",45000
3,Project Manager Business Analyst,"Job Description\nAt E78, we assist our clients...",Trillium Solutions Group\n4.8,"Horsham, PA",89000
4,Project Manager Business Analyst,Job Description\nCSS Tec is currently seeking ...,Contemporary Staffing Solutions\n4.4,"Jacksonville, FL",36000
...,...,...,...,...,...
2137,"Software Development Engineering, Analyst",Position Description What does a great Softwa...,Fiserv\n3.1,"Chicago, IL",43000
2138,Software Developer / Analyst,Job Title : Software Developer / Analyst Job...,Genuine IT\n4.3,"Houston, TX",91000
2139,Test Automation Analyst - II,SWBC has been recognized as one of the Best Co...,Southwest Business Corporation\n3.1,"San Antonio, TX",48000
2140,Test Automation Analyst II,SUMMARY\n\nCreates and maintains manual and au...,SWBC\n3.1,"San Antonio, TX",48000
2141,Test Automation Analyst II,SUMMARY Creates and maintains manual and auto...,SWBC\n3.1,"San Antonio, TX",48000

In [1035]:
glassdoor1['Experience'] = np.random.randint(1, 5, glassdoor1.shape[0])

In [1036]:
glassdoor2['Experience'] = np.random.randint(6, 11, glassdoor2.shape[0])

In [1040]:
glassdoor1 = glassdoor1.rename(columns = {"salary1":"salary"})
glassdoor2 = glassdoor2.rename(columns = {"salary2":"salary"})

In [1042]:
frame = [indeed1,indeed2,glassdoor1,glassdoor2]
total_data = pd.concat(frame)
total_data.head()

,title,company,summary,location,salary,Experience
0,Software Developer (No Prior Experience Required),Revature,College degree (Associates or Bachelors).\nMus...,"Washington, DC",31829.0,1
1,SQL Application Developer,ServiceSource Inc.,Assist with the management and coordination be...,"Capitol Heights, MD",234355.0,3
2,GIS Developer,Leidos,Train other team members on GIS and other GIS ...,"Washington, DC 20090 (South West area)+1 location",198075.0,2
3,Jr Software Developer,KSquare Inc.,BS/ MS in IT or equivalent is required with st...,"Greenbelt, MD 20770",50536.0,3
4,HP059 Junior Software Developer,"ADNET Systems, Inc.",Experience with using a Git workflow for softw...,"Greenbelt, MD 20771",122175.0,3

In [1043]:
#posted dates
total_data["posted_date"] = np.random.choice(pd.date_range('2017-01-01', '2021-01-01'), len(total_data))

In [1044]:
total_data.head()

,title,company,summary,location,salary,Experience,posted_date
0,Software Developer (No Prior Experience Required),Revature,College degree (Associates or Bachelors).\nMus...,"Washington, DC",31829.0,1,2019-11-29
1,SQL Application Developer,ServiceSource Inc.,Assist with the management and coordination be...,"Capitol Heights, MD",234355.0,3,2019-04-30
2,GIS Developer,Leidos,Train other team members on GIS and other GIS ...,"Washington, DC 20090 (South West area)+1 location",198075.0,2,2018-09-14
3,Jr Software Developer,KSquare Inc.,BS/ MS in IT or equivalent is required with st...,"Greenbelt, MD 20770",50536.0,3,2019-03-28
4,HP059 Junior Software Developer,"ADNET Systems, Inc.",Experience with using a Git workflow for softw...,"Greenbelt, MD 20771",122175.0,3,2018-04-18

In [1045]:
total_data.to_csv('total_jobs.csv')

In [1046]:
total_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30062 entries, 0 to 2141
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   title        30062 non-null  object
 1   company      30060 non-null  object
 2   summary      30062 non-null  object
 3   location     30062 non-null  object
 4   salary       30062 non-null  float64
 5   Experience   30062 non-null  int64
 6   posted_date  30062 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1), object(4)
memory usage: 1.8+ MB

In [968]:
#glassdoor.to_csv('glassdoor.csv')

In [1047]:
glassdoor1

,title,summary,company,location,salary,Experience
0,Project Manager / Business Analyst,Project Manager / Business Analyst\n\n\nIn the...,DNTG\n2.9,"Buena Park, CA",77000,3
1,Project Manager / Business Analyst,This is a hybrid role of PM and BA with 3 to 5...,Diversant LLC\n3.8,"Houston, TX",41000,2
2,Project Manager/Business Consultant,Project Manager/Business Consultant\n\nRespons...,TEC Group Inc,"Houston, TX",45000,2
3,Project Manager Business Analyst,"Job Description\nAt E78, we assist our clients...",Trillium Solutions Group\n4.8,"Horsham, PA",89000,3
4,Project Manager Business Analyst,Job Description\nCSS Tec is currently seeking ...,Contemporary Staffing Solutions\n4.4,"Jacksonville, FL",36000,2
...,...,...,...,...,...,...
2137,"Software Development Engineering, Analyst",Position Description What does a great Softwa...,Fiserv\n3.1,"Chicago, IL",43000,1
2138,Software Developer / Analyst,Job Title : Software Developer / Analyst Job...,Genuine IT\n4.3,"Houston, TX",91000,1
2139,Test Automation Analyst - II,SWBC has been recognized as one of the Best Co...,Southwest Business Corporation\n3.1,"San Antonio, TX",48000,1
2140,Test Automation Analyst II,SUMMARY\n\nCreates and maintains manual and au...,SWBC\n3.1,"San Antonio, TX",48000,1
2141,Test Automation Analyst II,SUMMARY Creates and maintains manual and auto...,SWBC\n3.1,"San Antonio, TX",48000,1